In [664]:
import pandas as pd
pd.set_option('display.float_format', '{:.2f}'.format)

In [665]:
df = pd.read_csv('df_final.csv')

In [666]:
df = df.drop(columns=['Unnamed: 0'])

In [667]:
df.head(2)

,year,month,day,hour,quantity_purchased,amount_in_gbp,branch_name,product,region,county,established_on,operational_cost,staff_bonuses,misc_expenses,waste_cost,manufactuter,category,price
0,2010,1,9,0,182,145.60,Bassetlaw outlet,chocolate twist,East Midlands,Bassetlaw,2010,2838,296,9455,6366,in-house,bakery,1.00
1,2010,1,9,0,98,313.60,Bassetlaw outlet,plastic sunshades,East Midlands,Bassetlaw,2010,2838,296,9455,6366,in-house,clothing,4.00

In [668]:
df.dtypes

year                    int64
month                   int64
day                     int64
hour                    int64
quantity_purchased     object
amount_in_gbp         float64
branch_name            object
product                object
region                 object
county                 object
established_on          int64
operational_cost        int64
staff_bonuses           int64
misc_expenses           int64
waste_cost              int64
manufactuter           object
category               object
price                 float64
dtype: object

In [669]:
df['quantity_purchased'] = df['quantity_purchased'].replace('-', '')

In [670]:
df['quantity_purchased'] = pd.to_numeric(df['quantity_purchased'])

In [671]:
df.head(2)

,year,month,day,hour,quantity_purchased,amount_in_gbp,branch_name,product,region,county,established_on,operational_cost,staff_bonuses,misc_expenses,waste_cost,manufactuter,category,price
0,2010,1,9,0,182.00,145.60,Bassetlaw outlet,chocolate twist,East Midlands,Bassetlaw,2010,2838,296,9455,6366,in-house,bakery,1.00
1,2010,1,9,0,98.00,313.60,Bassetlaw outlet,plastic sunshades,East Midlands,Bassetlaw,2010,2838,296,9455,6366,in-house,clothing,4.00

In [672]:
top_products_overall = df.groupby('product').agg({'quantity_purchased' : 'sum'}).nlargest(5, 'quantity_purchased').reset_index()

In [673]:
top_products_overall

                     product  quantity_purchased
0           custard doughnut            25119.00
1       organic soured cream            23794.00
2          pain au chocolate            22455.00
3  free range large eggs x12            22403.00
4                cod fillets            22362.00

In [674]:
bot_products_overall = df.groupby('product').agg({'quantity_purchased' : 'sum'}).nsmallest(5, 'quantity_purchased').reset_index()

In [675]:
bot_products_overall

                               product  quantity_purchased
0  british fresh chicken brest fillets            14913.00
1               british parsnips loose            15434.00
2                         macaron - x3            16170.00
3              samsung washing machine            16175.00
4        British baking potatoes loose            16279.00

In [676]:
df['category'].nunique()

9

In [677]:
top_cat_overall = df.groupby('category').agg({'quantity_purchased' : 'sum'}).nlargest(4, 'quantity_purchased').reset_index()

In [678]:
top_cat_overall

              category  quantity_purchased
0                dairy           398650.00
1          meat & fish           386075.00
2             clothing           368483.00
3  fruits & vegetables           353637.00

In [679]:
bot_cat_overall = df.groupby('category').agg({'quantity_purchased' : 'sum'}).nsmallest(4, 'quantity_purchased').reset_index()

In [680]:
bot_cat_overall

             category  quantity_purchased
0  fruits & vegetable            17942.00
1           computing           108628.00
2          appliances           129290.00
3              gaming           265831.00

In [681]:
df['region'].nunique()

3

In [682]:
top_products_region = df.groupby(['product', 'region']).agg({'quantity_purchased' : 'sum'}).nlargest(1, 'quantity_purchased').reset_index()

In [683]:
top_products_region

                product         region  quantity_purchased
0  organic soured cream  East Midlands            14754.00

In [684]:
bot_products_region = df.groupby(['product', 'region']).agg({'quantity_purchased' : 'sum'}).nsmallest(1, 'quantity_purchased').reset_index()

In [685]:
bot_products_region

                      product           region  quantity_purchased
0  21 day mature ribeye steak  East of England                0.00

In [686]:
df['category'].nunique()

9

In [687]:
top_cat_region = df.groupby(['category', 'region']).agg({'quantity_purchased' : 'sum'}).nlargest(1, 'quantity_purchased').reset_index()

In [688]:
top_cat_region

  category         region  quantity_purchased
0    dairy  East Midlands           201870.00

In [689]:
bot_cat_region = df.groupby(['category', 'region']).agg({'quantity_purchased' : 'sum'}).nsmallest(1, 'quantity_purchased').reset_index()

In [690]:
bot_cat_region

     category           region  quantity_purchased
0  appliances  East of England                0.00

In [691]:
top_products_county = df.groupby(['product', 'county']).agg({'quantity_purchased' : 'sum'}).nlargest(1, 'quantity_purchased').reset_index()

In [692]:
top_products_county

                product     county  quantity_purchased
0  organic soured cream  Bassetlaw            14754.00

In [693]:
bot_products_county = df.groupby(['product', 'county']).agg({'quantity_purchased' : 'sum'}).nsmallest(1, 'quantity_purchased').reset_index()

In [694]:
bot_products_county

                      product        county  quantity_purchased
0  21 day mature ribeye steak  Castle Point                0.00

In [695]:
top_cat_county = df.groupby(['category', 'county']).agg({'quantity_purchased' : 'sum'}).nlargest(1, 'quantity_purchased').reset_index()

In [696]:
top_cat_county

  category     county  quantity_purchased
0    dairy  Bassetlaw           201870.00

In [697]:
bot_cat_county = df.groupby(['category', 'county']).agg({'quantity_purchased' : 'sum'}).nsmallest(1, 'quantity_purchased').reset_index()

In [698]:
bot_cat_county

     category        county  quantity_purchased
0  appliances  Castle Point                0.00

In [699]:
df['branch_name'].nunique()

3

In [700]:
df['value'] = df['quantity_purchased'] * df['price']

In [701]:
df.head(2)

,year,month,day,hour,quantity_purchased,amount_in_gbp,branch_name,product,region,county,established_on,operational_cost,staff_bonuses,misc_expenses,waste_cost,manufactuter,category,price,value
0,2010,1,9,0,182.00,145.60,Bassetlaw outlet,chocolate twist,East Midlands,Bassetlaw,2010,2838,296,9455,6366,in-house,bakery,1.00,182.00
1,2010,1,9,0,98.00,313.60,Bassetlaw outlet,plastic sunshades,East Midlands,Bassetlaw,2010,2838,296,9455,6366,in-house,clothing,4.00,392.00

In [702]:
df['Datetime'] = pd.to_datetime(df[['year', 'month', 'day', 'hour']])

In [703]:
df

,year,month,day,hour,quantity_purchased,amount_in_gbp,branch_name,product,region,county,established_on,operational_cost,staff_bonuses,misc_expenses,waste_cost,manufactuter,category,price,value,Date
0,2010,1,9,0,182.00,145.60,Bassetlaw outlet,chocolate twist,East Midlands,Bassetlaw,2010,2838,296,9455,6366,in-house,bakery,1.00,182.00,2010-01-09 00:00:00
1,2010,1,9,0,98.00,313.60,Bassetlaw outlet,plastic sunshades,East Midlands,Bassetlaw,2010,2838,296,9455,6366,in-house,clothing,4.00,392.00,2010-01-09 00:00:00
2,2010,1,9,0,151.00,12080.00,Bassetlaw outlet,lg washing machine,East Midlands,Bassetlaw,2010,2838,296,9455,6366,lg,appliances,100.00,15100.00,2010-01-09 00:00:00
3,2010,1,9,0,230.00,257.60,Bassetlaw outlet,fresh whole chicken,East Midlands,Bassetlaw,2010,2838,296,9455,6366,farmer jack,meat & fish,1.40,322.00,2010-01-09 00:00:00
4,2010,1,9,0,150.00,180.00,Bassetlaw outlet,free range large eggs x12,East Midlands,Bassetlaw,2010,2838,296,9455,6366,sam and catherine,dairy,1.50,225.00,2010-01-09 00:00:00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,2010,1,4,20,61.00,48.80,Cheshire East outlet,Slightly salted butter,North West England,Cheshire East,2010,2926,277,8529,5309,sam and catherine,dairy,1.00,61.00,2010-01-04 20:00:00
29996,2010,1,4,20,231.00,110.88,Cheshire East outlet,pain au chocolate,North West England,Cheshire East,2010,2926,277,8529,5309,in-house,bakery,0.60,138.60,2010-01-04 20:00:00
29997,2010,1,4,20,102.00,244.80,Cheshire East outlet,diced chicken breast,North West England,Cheshire East,2010,2926,277,8529,5309,farmer jack,meat & fish,3.00,306.00,2010-01-04 20:00:00
29998,2010,1,4,20,22.00,35.20,Cheshire East outlet,millionaire square,North West England,Cheshire East,2010,2926,277,8529,5309,in-house,bakery,2.00,44.00,2010-01-04 20:00:00
29999,2010,1,4,20,207.00,291.46,Cheshire East outlet,british bramley cooking apples,North West England,Cheshire East,2010,2926,277,8529,5309,sainsburys,fruits & vegetables,1.76,364.32,2010-01-04 20:00:00

In [704]:
top_branches_overall = df.groupby('branch_name').agg({'value' : 'sum'}).nlargest(2, 'value').reset_index()

In [705]:
top_branches_overall

            branch_name        value
0      Bassetlaw outlet 136911278.06
1  Cheshire East outlet 132027270.54

In [706]:
hourly_data = df[['branch_name', 'value', 'Date']]

In [707]:
hourly_data

                branch_name    value                Date
0          Bassetlaw outlet   182.00 2010-01-09 00:00:00
1          Bassetlaw outlet   392.00 2010-01-09 00:00:00
2          Bassetlaw outlet 15100.00 2010-01-09 00:00:00
3          Bassetlaw outlet   322.00 2010-01-09 00:00:00
4          Bassetlaw outlet   225.00 2010-01-09 00:00:00
...                     ...      ...                 ...
29995  Cheshire East outlet    61.00 2010-01-04 20:00:00
29996  Cheshire East outlet   138.60 2010-01-04 20:00:00
29997  Cheshire East outlet   306.00 2010-01-04 20:00:00
29998  Cheshire East outlet    44.00 2010-01-04 20:00:00
29999  Cheshire East outlet   364.32 2010-01-04 20:00:00

[30000 rows x 3 columns]

In [737]:
hourly_data.groupby(pd.Grouper(freq='H', key='Date')).value.count()

Date
2010-01-01 10:00:00    0
2010-01-01 11:00:00    0
2010-01-01 12:00:00    0
2010-01-01 13:00:00    0
2010-01-01 14:00:00    0
                      ..
2010-02-24 21:00:00    0
2010-02-24 22:00:00    0
2010-02-24 23:00:00    0
2010-02-25 00:00:00    0
2010-02-25 01:00:00    0
Freq: H, Name: value, Length: 1312, dtype: int64

In [709]:
bot_branches_overall = df.groupby('branch_name', ).agg({'value' : 'sum'}).nsmallest(1, 'value').reset_index()

In [710]:
bot_branches_overall

           branch_name  value
0  Castle Point outlet   0.00

In [711]:
top_branches_region = df.groupby(['branch_name', 'region']).agg({'value' : 'sum'}).nlargest(1, 'value').reset_index()

In [712]:
top_branches_region

        branch_name         region        value
0  Bassetlaw outlet  East Midlands 136911278.06

In [713]:
bot_branches_region = df.groupby(['branch_name', 'region']).agg({'value' : 'sum'}).nsmallest(1, 'value').reset_index()

In [714]:
bot_branches_region

           branch_name           region  value
0  Castle Point outlet  East of England   0.00

In [715]:
top_branches_county = df.groupby(['branch_name', 'county']).agg({'value' : 'sum'}).nlargest(1, 'value').reset_index()

In [716]:
top_branches_county

        branch_name     county        value
0  Bassetlaw outlet  Bassetlaw 136911278.06

In [717]:
bot_branches_county = df.groupby(['branch_name', 'county']).agg({'value' : 'sum'}).nsmallest(1, 'value').reset_index()

In [718]:
bot_branches_county

           branch_name        county  value
0  Castle Point outlet  Castle Point   0.00

In [719]:
df['quantity_purchased'] = pd.to_numeric(df['quantity_purchased'])

In [720]:
df.dtypes

year                           int64
month                          int64
day                            int64
hour                           int64
quantity_purchased           float64
amount_in_gbp                float64
branch_name                   object
product                       object
region                        object
county                        object
established_on                 int64
operational_cost               int64
staff_bonuses                  int64
misc_expenses                  int64
waste_cost                     int64
manufactuter                  object
category                      object
price                        float64
value                        float64
Date                  datetime64[ns]
dtype: object

In [721]:
df['total_expenses'] = df.apply(lambda row: row.operational_cost + row.staff_bonuses + row.misc_expenses + row.waste_cost, axis=1)

In [722]:
df.head(2)

,year,month,day,hour,quantity_purchased,amount_in_gbp,branch_name,product,region,county,...,operational_cost,staff_bonuses,misc_expenses,waste_cost,manufactuter,category,price,value,Date,total_expenses
0,2010,1,9,0,182.00,145.60,Bassetlaw outlet,chocolate twist,East Midlands,Bassetlaw,...,2838,296,9455,6366,in-house,bakery,1.00,182.00,2010-01-09,18955
1,2010,1,9,0,98.00,313.60,Bassetlaw outlet,plastic sunshades,East Midlands,Bassetlaw,...,2838,296,9455,6366,in-house,clothing,4.00,392.00,2010-01-09,18955

In [723]:
total_expenses = df.groupby('branch_name').head(1)

In [724]:
total_expenses = total_expenses[['branch_name', 'total_expenses']].reset_index().drop(columns=['index'])

In [725]:
total_expenses

            branch_name  total_expenses
0      Bassetlaw outlet           18955
1   Castle Point outlet           13851
2  Cheshire East outlet           17041

In [726]:
total_sales = df.groupby(['branch_name']).agg({'amount_in_gbp' : 'sum'}).reset_index()

In [727]:
total_sales

            branch_name  amount_in_gbp
0      Bassetlaw outlet   109549480.61
1   Castle Point outlet   107660501.70
2  Cheshire East outlet   105653744.11

In [728]:
df_merged = total_sales.merge(total_expenses, how='left', on='branch_name')

In [729]:
df_merged

            branch_name  amount_in_gbp  total_expenses
0      Bassetlaw outlet   109549480.61           18955
1   Castle Point outlet   107660501.70           13851
2  Cheshire East outlet   105653744.11           17041

In [730]:
df_merged['profit'] = df_merged['amount_in_gbp'] - df_merged['total_expenses']

In [731]:
df_merged

            branch_name  amount_in_gbp  total_expenses       profit
0      Bassetlaw outlet   109549480.61           18955 109530525.61
1   Castle Point outlet   107660501.70           13851 107646650.70
2  Cheshire East outlet   105653744.11           17041 105636703.11

In [732]:
top_profitable = df_merged.head(1)

In [733]:
top_profitable

        branch_name  amount_in_gbp  total_expenses       profit
0  Bassetlaw outlet   109549480.61           18955 109530525.61

In [734]:
bot_profitable = df_merged.tail(1)

In [735]:
bot_profitable

            branch_name  amount_in_gbp  total_expenses       profit
2  Cheshire East outlet   105653744.11           17041 105636703.11